MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EZR32HG320F32R55/mcu.h
/** Flash and SRAM limits for EZR32HG320F32R55 */
#define FLASH_BASE           (0x00000000UL) /**< Flash Base Address */
#define FLASH_SIZE           (0x00008000UL) /**< Available Flash Memory */
#define FLASH_PAGE_SIZE      1024U          /**< Flash Memory page size */
#define SRAM_BASE            (0x20000000UL) /**< SRAM Base Address */
#define SRAM_SIZE            (0x00002000UL) /**< Available SRAM Memory */
#define __CM0PLUS_REV        0x0001U        /**< Cortex-M0+ Core revision r0p1 */
#define PRS_CHAN_COUNT       6              /**< Number of PRS channels */
#define DMA_CHAN_COUNT       6              /**< Number of DMA channels */
#define EXT_IRQ_COUNT        21             /**< Number of External (NVIC) interrupts */

/** AF channels connect the different on-chip peripherals with the af-mux */
#define AFCHAN_MAX           42U
#define AFCHANLOC_MAX        7U
/** Analog AF channels */
#define AFACHAN_MAX          27U

/* Part number capabilities */

#define TIMER_PRESENT             /**< TIMER is available in this part */
#define TIMER_COUNT             3 /**< 3 TIMERs available  */
#define USART_PRESENT             /**< USART is available in this part */
#define USART_COUNT             1 /**< 1 USARTs available  */
#define USARTRF_PRESENT           /**< USARTRF is available in this part */
#define USARTRF_COUNT           1 /**< 1 USARTRFs available  */
#define IDAC_PRESENT              /**< IDAC is available in this part */
#define IDAC_COUNT              1 /**< 1 IDACs available  */
#define ADC_PRESENT               /**< ADC is available in this part */
#define ADC_COUNT               1 /**< 1 ADCs available  */
#define LEUART_PRESENT            /**< LEUART is available in this part */
#define LEUART_COUNT            1 /**< 1 LEUARTs available  */
#define PCNT_PRESENT              /**< PCNT is available in this part */
#define PCNT_COUNT              1 /**< 1 PCNTs available  */
#define I2C_PRESENT               /**< I2C is available in this part */
#define I2C_COUNT               1 /**< 1 I2Cs available  */
#define AES_PRESENT               /**< AES is available in this part */
#define AES_COUNT               1 /**< 1 AES available */
#define DMA_PRESENT               /**< DMA is available in this part */
#define DMA_COUNT               1 /**< 1 DMA available */
#define LE_PRESENT                /**< LE is available in this part */
#define LE_COUNT                1 /**< 1 LE available */
#define USBC_PRESENT              /**< USBC is available in this part */
#define USBC_COUNT              1 /**< 1 USBC available */
#define USBLE_PRESENT             /**< USBLE is available in this part */
#define USBLE_COUNT             1 /**< 1 USBLE available */
#define USB_PRESENT               /**< USB is available in this part */
#define USB_COUNT               1 /**< 1 USB available */
#define MSC_PRESENT               /**< MSC is available in this part */
#define MSC_COUNT               1 /**< 1 MSC available */
#define EMU_PRESENT               /**< EMU is available in this part */
#define EMU_COUNT               1 /**< 1 EMU available */
#define RMU_PRESENT               /**< RMU is available in this part */
#define RMU_COUNT               1 /**< 1 RMU available */
#define CMU_PRESENT               /**< CMU is available in this part */
#define CMU_COUNT               1 /**< 1 CMU available */
#define PRS_PRESENT               /**< PRS is available in this part */
#define PRS_COUNT               1 /**< 1 PRS available */
#define GPIO_PRESENT              /**< GPIO is available in this part */
#define GPIO_COUNT              1 /**< 1 GPIO available */
#define VCMP_PRESENT              /**< VCMP is available in this part */
#define VCMP_COUNT              1 /**< 1 VCMP available */
#define RTC_PRESENT               /**< RTC is available in this part */
#define RTC_COUNT               1 /**< 1 RTC available */
#define HFXTAL_PRESENT            /**< HFXTAL is available in this part */
#define HFXTAL_COUNT            1 /**< 1 HFXTAL available */
#define LFXTAL_PRESENT            /**< LFXTAL is available in this part */
#define LFXTAL_COUNT            1 /**< 1 LFXTAL available */
#define USHFRCO_PRESENT           /**< USHFRCO is available in this part */
#define USHFRCO_COUNT           1 /**< 1 USHFRCO available */
#define WDOG_PRESENT              /**< WDOG is available in this part */
#define WDOG_COUNT              1 /**< 1 WDOG available */
#define DBG_PRESENT               /**< DBG is available in this part */
#define DBG_COUNT               1 /**< 1 DBG available */
#define MTB_PRESENT               /**< MTB is available in this part */
#define MTB_COUNT               1 /**< 1 MTB available */
#define BOOTLOADER_PRESENT        /**< BOOTLOADER is available in this part */
#define BOOTLOADER_COUNT        1 /**< 1 BOOTLOADER available */
#define ANALOG_PRESENT            /**< ANALOG is available in this part */
#define ANALOG_COUNT            1 /**< 1 ANALOG available */

/***************************************************************************//**
 * @defgroup EZR32HG320F32R55_RF_Interface EZR32HG320F32R55 RF_Interface
 * @brief MCU port/pins used for RF interface.
 * @{
 ******************************************************************************/
#define RF_USARTRF_LOCATION     5     /**< RF SPI-port (USART) location number. */
#define RF_USARTRF_CS_PORT      2     /**< Bit banged RF SPI CS GPIO port no.   */
#define RF_USARTRF_CS_PIN       0     /**< Bit banged RF SPI CS GPIO pin number.*/
#define RF_USARTRF_CLK_PORT     2     /**< RF SPI CLK GPIO port number.      */
#define RF_USARTRF_CLK_PIN      3     /**< RF SPI CLK GPIO pin number.       */
#define RF_USARTRF_MISO_PORT    2     /**< RF SPI MISO GPIO port number.     */
#define RF_USARTRF_MISO_PIN     2     /**< RF SPI MISO GPIO pin number.      */
#define RF_USARTRF_MOSI_PORT    2     /**< RF SPI MOSI GPIO port number.     */
#define RF_USARTRF_MOSI_PIN     1     /**< RF SPI MOSI GPIO pin number.      */
#define RF_INT_PORT             2     /**< RF interrupt GPIO port number.    */
#define RF_INT_PIN              4     /**< RF interrupt GPIO pin number.     */
#define RF_SDN_PORT             0     /**< RF SDN GPIO port number.          */
#define RF_SDN_PIN              2     /**< RF SDN GPIO pin number.           */

/** @} End of group EZR32HG320F32R55_RF_Interface */

/** @} End of group EZR32HG320F32R55_Part */

#define ARM_MATH_CM0PLUS
// #include "core_cm0plus.h" /* Cortex-M0+ processor and core peripherals */  // Note: Changed for MikroE implementation.
// #include "system_ezr32hg.h" /* System Header */  // Note: Changed for MikroE implementation.
#include <stdint.h>
#define     __I     volatile const       /*!< Defines 'read only' permissions */
#define     __O     volatile             /*!< Defines 'write only' permissions */
#define     __IO    volatile             /*!< Defines 'read / write' permissions */

/* following defines should be used for structure members */
#define     __IM     volatile const      /*! Defines 'read only' structure member permissions */
#define     __OM     volatile            /*! Defines 'write only' structure member permissions */
#define     __IOM    volatile            /*! Defines 'read / write' structure member permissions */

